{
    "id": "baitali",
    "tasks": [
        {
            "title": "Kabalebo FMS failure ",
            "description": "On Sunday, July 27th, an inspection was requested for the FMS system at the Kabalebo site. Due to a lightning strike, both the Nocru board and the TLS board have malfunctioned. The TLS board has been transported to Paramaribo for further troubleshooting. A report has been submitted to the client, and an updated quote has been requested. We are currently awaiting the quote, and we are preparing to repair the TLS board and acquire a new Nocru board to resolve the issue.",
            "status": "In Progress"
        },
        {
            "title": "T-83 Fuel truck ORCU upgrade",
            "description": "The Fuel truck computer (ORCU board ) is no longer working. The system can not refuel equipment on site. The bypass option is being used. Data is being captured manually for distribution. The Orcu board required an upgrade to the Norcu board. The upgrade has been requested, and the client is waiting for it.",
            "status": "In Progress"
        },
        {
            "title": "UCC Master card usage",
            "description": "The Master card is used for some additional equipment, but is not registered in the overview of the  FuelOnet platform. On the SiteOmat, the vehicle information can be extracted. A ticket has been raised for the GVR team to follow up with this.\n",
            "status": "In Progress"
        },
        {
            "title": "FuelOnet Sync (Baitali station & Fuel truck",
            "description": "Requested the additional information to start the sync process. Meetings have been requested to start after the FuelOnet issue has been resolved.",
            "status": "In Progress"
        },
        {
            "title": "Baitali Fuel consolidation reporting",
            "description": "A recent meeting was held with the Fuel Manager. Meeting notes and concerns have been submitted to management for review. We are currently awaiting approval to proceed.",
            "status": "Suggestion"
        }
        
    ]
}