{
    "id": "newmont",
    "tasks": [
        {
            "title": "Investigation of Tank Level Discrepancies",
            "description": "A significant discrepancy was detected between the fuel volume recorded by the inlet meter and what is reflected in the tank levels. Although deliveries are validated as complete, the tank measurement system consistently reports much lower volumes, such as a delivery of 34,000 liters showing only 27,000. It is concluded that the tank level measurement system is faulty, and its repair or replacement is requested.\n",
            "status": "Pending"
        },
        {
            "title": "Fuel Reconciliation Anomaly, July 13, 2025",
            "description": "A negative variation of -1.84% (-3047.95 L) was detected in the diesel reconciliation on July 13. The analysis of storage trends shows an anomalous and sudden drop in the main tank level on July 14 around 08:00. This unrecorded inventory loss is the direct cause of the discrepancy. It is recommended to investigate the event to determine the root cause of the fuel loss.",
            "status": "Pending"
        },
        {
            "title": "Unauthorized dispenses",
            "description": "Comment recorded regarding ID assignment for unauthorized transactions in Lane 3. Specifically, the transactions:\n\n- Dispensing Transaction #171017;  19/07/2025 11:47\n- Dispensing Transaction #170972;  19/07/2025 08:39\n- Dispensing Transaction #170909; 18/07/2025 22:35\n\n",
            "status": "Complete"
        },
        {
            "title": "Burn rate Data Problem",
            "description": "Monitoring of inconsistencies in some equipment is being carried out in the burn rate report from July 1 to July 18, during which the following equipment recorded zero burn rate values, despite consuming fuel according to the records.\n\nNote: This issue was first reported to Veridapt on June 5, 2024; however, it is still occurring to this date. Although the Dispenses record the operating hours and fuel consumed, when the burn rate report is generated, on some days the burn rate is recorded as zero.\n\n\n\nDRT0602\nDRT0604\nDZT0751\nDZT0752\nDZT0753\nDZT0754\nDZT0755\nDZT0756\nDZT0759\nDZT0760\nDZT0761\nEXC0719\nEXC0721\nEXC0722\nEXC0724\nEXC0725\nFT001\nFT004\nFT005\nGRM0773\nGRM0775\nGRM0776\nHTK0802\nHTK0803\nHTK0807\nHTK0809\nHTK0811\nHTK0816\nHTK0817\nHTK0820\nHTK0821\nHTK0822\nHTK0824\nHTK0826\nHTK0830\nLDW0880\nSHO0702\nSHO0703\nTFL0847\nTFL0848\nWTK0845\n\n\n\n",
            "status": "Pending"
        }
    ]
}