{
    "id": "rgm",
    "tasks": [
        {
            "title": "Translation Issues in FON Prime Platform",
            "description": "An email from the GVR team mentioned that fixes related to Spanish and Portuguese translations in various GUI sections had been applied. However, after a review by PLG, several sections still require corrections. PLG is awaiting a response on this matter.",
            "status": "Action Required"
        },
        {
            "title": "DB248 Enhance broken",
            "description": "Days after replacing the DB248 Enhance with the older Enhance from DB246, the on-site crew reported a bricked HDD. A new Truck Prim UX controller (SINO 3) should be used.",
            "status": "Complete"
        },
        {
            "title": "Fuel ONET Rules Added from PLG Side",
            "description": "Fuel ONET rules were added to the 55 requested pieces of equipment (as agreed with GVR after the migration), as well as to recently added ones.",
            "status": "Complete"
        },
        {
            "title": "C2FT-004 Chip replaced",
            "description": "After several checks by the PLG team, a malfunctioning chip was identified. Following the replacement, the equipment was successfully refueled with DB252.",
            "status": "Complete"
        },
        {
            "title": "Vincent's training progress",
            "description": "This week, we covered the Reconciliation reports. The TFC and Burn Rates reports are still pending. Vincent is expected to send his first Reconciliation and Consumption reports this week.",
            "status": "In Progress"
        },
        {
            "title": "FON Prime GVR - Creation of Limit Rules Regarding Tank Capacity for All Migrated Fleet to FON by GVR Team",
            "description": "During training sessions with Silva, a security concern was raised. Silva noted that the tank capacity field does not restrict refueling beyond equipment capacity. To address this, limit rules should be created based on tank capacities. It was agreed that Silva's team will handle the migrated fleet, while we will manage the new entries.",
            "status": "Pending"
        },
        
        {
            "title": "Fake Bypass alarm fixing",
            "description": "Saawan and the team at Fusecon successfully tested the new automation suggested by GVR. SINO 2 is now using this automation, and the changes are being shared with PLG electrician experts at RGM to implement the same for CAT1, CAT2, and SINO1.",
            "status": "Pending"
        }        
    ]
}